/**/
"Cancel" = "Cancelar";
/**/
"Delete" = "Excluir";
/**/
"Open" = "Abrir";
/**/
"Edit" = "Editar";
/**/
"Yes" = "Sim";
/**/
"Finish" = "Finalizar";
/**/
"Done" = "Concluído";
/**/
"Save" = "Salvar";
/**/
"Undo" = "Desfazer";
/**/
"Redo" = "Refazer";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Sim, Excluir";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Aplicar Geometria";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Limpar Geometria";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Excluir Vértice";
/*Geometry Edit Action Name*/
"Insert Part" = "Inserir Parte";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Inserir Vértice";
/*Geometry Edit Action Name*/
"Move Vertex" = "Mais Vértice";
/*Geometry Edit Action Name*/
"Remove Part" = "Remover Parte";

/*Collecting attachments*/
"Add" = "Adicionar";
/*Collecting attachments*/
"Take Photo or Video" = "Tirar Foto ou Vídeo";
/*Collecting attachments*/
"Choose From Library" = "Escolher da Biblioteca";
/*Collecting attachments*/
"Photo" = "Foto";
/*Collecting attachments*/
"Video" = "Vídeo";
/*Collecting attachments*/
"Save To Photo Library" = "Salvar na Biblioteca de Imagens";
/*Collecting attachments*/
"Download" = "Download";

/*Date attribute*/
"Today" = "Hoje";

/**/
"Attachments" = "Anexos";
"Attributes" = "Atributos";

/**/
"Open in Safari" = "Abrir no Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Digite um número entre %i e %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Insira um número entre %@ e %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Muitos caracteres (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "O número está fora do intervalo aceitável.";

/* BLOB, RASTER, etc */
"Field type not supported" = "O tipo de campo não é suportado";

/**/
"%d of %d" = "%d de %d";

/**/
"Changing Feature Type" = "Alterando o tipo de feição";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Você está alterando o tipo de feição, o que possivelmente poderá substituir alguns valores de campo. Tem certeza que deseja fazer isso?";

/**/
"Deleting Feature" = "Excluindo Feição";
"Are you sure you want to delete this feature?" = "Tem certeza que deseja excluir esta feição?";

/**/
"Data for pie chart is invalid" = "Os dados para o gráfico de pizza não são válidos";
"No data to create a pie chart" = "Não há dados para criar um gráfico de pizza";
"No image to display" = "Nenhuma imagem para exibir";

/**/
"Created by %@ seconds ago" = "Criado por %@ segundos atrás";

/**/
"Created by %@ a minute ago" = "Criado por %@ um minuto atrás";

/**/
"Edited by %@ seconds ago" = "Editado por %@ segundos atrás";

/**/
"Edited by %@ a minute ago" = "Editado por %@ um minuto atrás";

/**/
"Created seconds ago" = "Criado segundos atrás";

/**/
"Created a minute ago" = "Criado um minuto atrás";

/**/
"Edited seconds ago" = "Editado segundos atrás";

/**/
"Edited a minute ago" = "Editado um minuto atrás";

/**/
"Created by %@ %d minutes ago" = "Criado por %@ %d minutos atrás";

/**/
"Created by %@ an hour ago" = "Criado por %@ uma hora atrás";

/**/
"Created by %@ %d hours ago" = "Criado por %@ %d horas atrás";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Criado por %@ no %@ às %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Criado por %@ no %@ às %@";

/**/
"Edited by %@ %d minutes ago" = "Editado por %@ %d minutos atrás";

/**/
"Edited by %@ an hour ago" = "Editado por %@ uma hora atrás";

/**/
"Edited by %@ %d hours ago" = "Editado por %@ %d horas atrás";

/**/
"Edited by %@ on %@ at %@ - day" = "Editado por %@ no %@ às %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Editado por %@ no %@ às %@";

/**/
"Created by %@" = "Criado por %@";

/**/
"Edited by %@" = "Editado por %@";

/**/
"Created %d minutes ago" = "Criado %d minutos atrás";

/**/
"Created an hour ago" = "Criado uma hora atrás";

/**/
"Created %d hours ago" = "Criado %d horas atrás";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Criado no %@ às %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Criado no %@ às %@";

/**/
"Edited %d minutes ago" = "Editado %d minutos atrás";

/**/
"Edited an hour ago" = "Editado uma hora atrás";

/**/
"Edited %d hours ago" = "Editado %d horas atrás";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Editado em %@ às %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Editado em %@ às %@";

/* Used to denote a required field */
"Required" = "Obrigatório";

/* Used for naming layers with no names */
"Layer %d" = "Camada %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Não é possível localizar endereço para local";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Não é possível localizar local para endereço";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Não é possível ler endereço";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Arquivo não encontrado";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Não é possível carregar localizador";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Erro inteo do localizador";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "A geocodificação de intersecções não é suportada pelo localizador";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Propriedades do localizador inválidas";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "O campo exigido está ausente";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "O localizador não foi inicializado";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Formato do localizador sem suporte";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Transformação de projeção sem suporte";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Referência espacial sem suporte";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Geocodificação reversa sem suporte com este localizador.";

/* Network analyst errors */
"Cannot open network." = "Não é possível abrir rede.";
"Cannot retrieve route task parameters." = "Não é possível recuperar parâmetros da tarefa de rota.";
"Insufficient number of stops." = "Número insuficiente de paradas.";
"Stop (%@) was not located." = "Parada (%@) não foi localizado.";
"Stop (%@) is located on a non traversable element." = "Parada (%@) está localizada em um elemento não atravessável.";
"Stop (%@) is located on a soft restricted element." = "Parada (%@) está localizada em um elemento restringido suave.";
"Point barrer (%@) was not located." = "Barreira de Ponto (%@) não foi localizada.";
"Point barrier (%@) has invalid added cost attribute name." = "Barreira de Ponto (%@) tem nome de atributo de custo adicionado inválido.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Barreira de linha (%@) tem nome de atributo de custo dimensionado inválido.";
"Line barrier (%@) does not cover any network elements." = "Barreira de  linha (%@) não cobre quaisquer elementos da rede.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Barreira de polígono (%@) tem nome de atributo de custo dimensionado inválido.";
"Polygon barrier (%@) does not cover any network elements." = "Barreira de polígono (%@) não cobre quaisquer elementos da rede.";
"'%@' is an invalid impedance attribute." = "'%@' é um atributo de impendância inválido.";
"'%@' restriction attribute is invalid." = "O atributo de restrição '%@' é inválido.";
"'%@' accumulate attribute is invalid." = "O atributo acumulado '%@' é inválido.";
"'%@' is an invalid directions time attribute." = "'%@' é um atributo de tempo das direções inválido.";
"Directions distance attribute is invalid." = "O atributo de distância das direções é inválido.";
"Invalid attribute parameter attribute name (%@)." = "Nome de atributo do parâmetro de atributo inválido (%@).";
"Invalid attribute parameter parameter name (%@)." = "Nome de parâmetro do parâmetro de atributo inválido (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Tipo de valor para atributo (%1$@) parâmetro (%2$@) inválido.";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valor de uso de restrição para atributo (%1$@) parâmetro (%2$@) inválido.";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valor de uso de restrição neutro para atributo (%1$@) parâmetro (%2$@).";
"Soft restricted element (%@) was traversed." = "Elemento restrito suave (%@) foi percorrido.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "A rede não tem um atributo de hierarquia para executar planejamento de rota hierárquico.";
"No path can be found between a given pair of stops (%@)." = "Nenhum caminho pode ser localizado entre um par de paradas fornecido (%@).";
"The input spatial reference is undefined." = "A referência espacial de entrada está indefinida.";
"The output spatial reference is undefined." = "A referência espacial de saída está indefinida.";
"The directions style is invalid." = "O estilo de direções é inválido.";
"The directions language is invalid." = "O idioma de direções é inválido.";
"Directions time and distance attributes do not match." = "Tempo de direções e atributos de distância não correspondem.";
"The directions road class attribute is invalid." = "O atributo da classe de estrada das direções é inválido.";
"Unknown condition." = "Condição desconhecida.";
"Invalid route task parameters." = "Parâmetros da tarefa de rota inválidos.";
"Route task's solution cannot be found." = "Não é possível localizar a solução da tarefa de rota.";
"Route task was cancelled." = "A tarefa de rota foi cancelada.";
"Route task internal error." = "Erro interno da tarefa de rota.";
"Route name property is not supported for local route task." = "A propriedade de nome da rota não é suportada para tarefa de rota local.";
"Local route task parameters should be retrieved from route task." = "Os parâmetros da tarefa de rota local  devem ser recuperados da tarefa de rota.";
"Cannot retrieve network description." = "Não é possível recuperar a descrição da rede.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Somente um atributo de comprimento pode ser especificado para impedanceAttributeName e accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Somente um atributo de cada vez pode ser especificado para impedanceAttributeName e accumulateAttributeNames.";
"Service not supported." = "Seriço sem suporte.";
"Specified start time occurs before January 1, 1970." = "A hora inicial especificada ocorre ante de 01 de Janeiro de 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "A parada (%@) tem uma hora inicial que ocorre ante de 01 de Janeiro de 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "A parada (%@) tem uma janela de tempo local que inicia ante de 01 de Janeiro de 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "A parada (%@) tem uma janela de tempo UTC que inicia ante de 01 de Janeiro de 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "A parada (%@) tem uma janela de tempo final que ocorre ante do início da sua janela de tempo.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "gd";
"dm" = "dm";
"ft" = "pés";
"in" = "pol";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Desconhecido";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centímetros";
"Decimal Degrees" = "Graus Decimais";
"Decimeters" = "Decímetros";
"Feet" = "Pés";
"Inches" = "Polegadas";
"Kilometers" = "Quilômetros";
"Meters" = "Metros";
"Miles" = "Milhas";
"Millimeters" = "Milímetros";
"Nautical Miles" = "Milhas Náuticas";
"Points" = "Pontos";
"Yards" = "Jardas";

/* Area Units Abbreviated Strings */
"sq. in" = "pol²";
"sq. ft" = "ft²";
"sq. yd" = "yd²";
"ac" = "ac";
"sq. mi" = "mi²";
"sq. mm" = "mm²";
"sq. cm" = "cm²";
"sq. dm" = "dm²";
"sq. m" = "m²";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "km²";

/* Area Units Display Strings */
"Square Inches" = "Polegadas Quadradas";
"Square Feet" = "Pés Quadrados";
"Square Yards" = "Jardas Quadradas";
"Acres" = "Acres";
"Square Miles" = "Milhas Quadradas";
"Square Millimeters" = "Milímetros Quadrados";
"Square Centimeters" = "Centímetros Quadrados";
"Square Decimeters" = "Decímetros Quadrados";
"Square Meters" = "Metros Quadrados";
"Ares" = "Ares";
"Hectares" = "Hectares";
"Square Kilometers" = "Quilômetros Quadrados";

/* Errors */
"Error" = "Erro";
"Class not @protocol AGSCoding compliant" = "Classe de @protocolo AGSCoding não compatível";
"Authorization required" = "Autorização exigida";
"Token is invalid or has expired" = "O token é inválido ou expirou";
"Unknown error occurred" = "Ocorreu um erro desconhecido";
"Empty username/password" = "Nome de usuário/senha vazio";
"Token URL is nil. You must set a valid token URL on the credential." = "A URL do token é nula. Você deve definir uma URL de token válida na credencial.";
"Unknown authentication error" = "Erro de autenticação desconhecido";
"Error extracting identity" = "Erro ao extrair identidade";
"Error adding identity to the keychain" = "Erro ao adicionar identidade na chave de série";
"Invalid Credentials" = "Credenciais Inválidas";
"Bad URL." = "URL Inválida.";
"The feature layer does not expose an object-id field." = "A camada de feição não expõe um campo de ID do objeto.";
"Both geodatabase and syncParams are required for this method." = "Geodatabase e syncParams são exigidos para este método.";
"Uploading deltas is not supported with this replica." = "A transferência de deltas não é suportada com este réplica.";
"Error creating delta geodatabase" = "Erro ao criar geodatabase delta";
"Unable to create result image layer" = "Não é possível criar a camada de imagem resultante";
"Cache at path '%@' not found." = "Cache no caminho '%@' não localizado.";
"To add an item, you must be logged in to the portal." = "Para adicionar um item, você deve estar conectado ao portal.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Para adicionar um item, você deve especificar um valor em AGSPortalItemContentParameters.";
"The portal failed to add the item." = "O portal falhou ao adicionar o item.";
"To delete an item, you must be logged in to the portal." = "Para excluir um item, você deve estar conectado ao portal.";
"The portal failed to delete the item." = "O portal falhou ao excluir o item.";
"To update an item, an itemId and logged in user are required." = "Para atualizar um item, um itemId e usuário conectado são exigidos.";
"The item failed to update." = "Falha ao atualizar item.";
"The item failed to update JSON." = "O item falhou ao atualizar JSON.";
"You must be logged in to a portal to add a comment." = "Você deve estar conectado ao portal para adicionar um comentário.";
"The comment failed to be added." = "Falha ao adicionar comentário.";
"You must be logged in to a portal to fetch the current user's rating." = "Você deve estar conectado ao portal para buscar a avaliação do usuário atual.";
"You must be logged in to a portal to add a rating." = "Você deve estar conectado ao portal para adicionar uma avaliação.";
"The rating failed to be added." = "Falha ao adicionar avaliação.";
"To share an item, you must be logged in to the portal." = "Para compartilhar um item, você deve estar conectado ao portal.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Para descompartilhar um item, você deve estar conectado ao portal e especificar grupos com os quais descompartilhar o item.";
"Bad Request" = "Pedido Inválido";
"Credential Required" = "AGSCredential Exigido";
"Job not created" = "Tarabalho não criado";
"Service did not return a valid URL" = "O serviço não retornou uma URL válida";
"Service did not return a file" = "O serviço não retornou um arquivo";
"Service did not return a size" = "O serviço não retornou um serviço";
"Job failed" = "Falha do trabalho";
"Job timed out" = "O trabalho expirou";
"Job was cancelled" = "O trabalho foi cancelado";
"Job was deleted" = "O trabalho foi excluído";
"Feature with objectId: %d not found" = "Feição com objectId: %d não localizada";
"No object-id values specified for feature table query." = "Nenhum valor de Object ID especificado para a consulta da tabela de feição.";

/* OAuth */
"The specified clientID is invalid" = "O clientID especificado é inválido";

/* Sync */
"Upload is not supported with this service." = "Transferência sem suporte com este serviço.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Para solicitar a sincronização, uma direção de sincronização diferente de AGSGDBSyncDirectionNone deve ser especificada.";